README.org
#+TITLE: Rudy Hill's dotfiles

* Preface
When I first started putting my dotfiles on Github, I simply copied and pasted the content onto the browser.
I say dofiles but it was really only my =.vimrc= at first, but when I started to use more configs, things got hairy quickly.
What I did was dumb so this repository is hopefully a remedy to that

This repository is really meant for me but I'd be honored if someone used it for their own purposes, even if just to compare, which is what I usually do.
I want to thank [[http://blog.smalleycreative.com/tutorials/using-git-and-github-to-manage-your-dotfiles/][smalleycreative]] for inspiration.

* Intro to =stow=
To use my dotfiles, GNU =stow= is a "dependecy".
You can move the files manually but why would you do that?
To put the vim files in your home directory, for example, change directories into this repository and run
#+BEGIN_SRC sh
stow vim -t ~
#+END_SRC

For noobs run:
#+BEGIN_SRC sh
man stow
#+END_SRC
for details

* Features
